app/controllers/motds_controller.rb

  def index
    @motds = Motd.all
---
SELECT * FROM `motds`

  def show
    @motd = Motd.find(params[:id])
---
SELECT * FROM `motds` WHERE (`motds`.`id` = 1)

  def create
    @motd = Motd.new(params[:motd])

    respond_to do |format|
      if @motd.save
---
INSERT INTO `motds` (`created_at`, `title`, `body`, `updated_at`) VALUES('2009-10-19 07:40:49', 'What to do, what to do?', 'What to do, what to do. One 300 dollar hookerbot or 300 one dollar hookerbots?', '2009-10-19 07:40:49')